test_cases/3d_water/3d_flashingHotWaterNozzle/0_flashNozzle_snappyHexMesh_hiRes/0/rho
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:  3.0                                   |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0";
    object      rho;
}

dimensions      [1 -3 0 0 0 0 0];

internalField   uniform 0;
boundaryField
{
    inlet //inflow boundary
    {
        type            thermDensity;
        phi             phiv;
        value           uniform 1110.646766;
    }
    
    outlet //outflow boundary
    {
        type            thermDensity;
        phi             phiv;
        inletValue      uniform 16.20667194;
        value           uniform 16.20667194;
    }

    walls
    {
        type            zeroGradient;
    }

    allBoundary
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
